export const PAGINATION_LIMIT = 10;

export const ACCOUNTS_TABLE_HEADS = [
  '고객명',
  '브로커명',
  '계좌번호',
  '계좌상태',
  '계좌명',
  '평가금액',
  '입금금액',
  '계좌 활성화 여부',
  '계좌 개설일',
];

export const STATUS: Record<number, string> = {
  9999: '관리자 확인 필요',
  1: '입금대기',
  2: '운용중',
  3: '투자중지',
  4: '해지',
};

export const BROKER: Record<string, string> = {
  '209': '유안타증권',
  '218': '현대증권',
  '230': '미래에셋증권',
  '238': '대우증권',
  '240': '삼성증권',
  '243': '한국투자증권',
  '247': '우리투자증권',
  '261': '교보증권',
  '262': '하이투자증권',
  '263': 'HMC투자증권',
  '264': '키움증권',
  '265': '이베스트투자증권',
  '266': 'SK증권',
  '267': '대신증권',
  '268': '아이엠투자증권',
  '269': '한화투자증권',
  '270': '하나대투자증권',
  '279': '동부증권',
  '280': '유진투자증권',
  '288': '카카오페이증권',
  '287': '메리츠종합금융증권',
  '290': '부국증권',
  '291': '신영증권',
  '292': 'LIG투자증권',
  '271': '토스증권',
};

export const USERS_TABLE_HEADS = [
  '고객명',
  '보유중인 계좌수',
  '이메일 주소',
  '주민등록상 성별코드',
  '생년월일',
  '휴대폰 번호',
  '최근로그인',
  '혜택 수신 동의 여부',
  '활성호 여부',
  '가입일',
];
